app/controllers/theates_controller.rb

SELECT `theates`.* FROM `theates`
---
  def index
    @theates = Theate.all

SELECT  "theates".* FROM "theates" WHERE "theates"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @theate = Theate.find(params[:id])

INSERT INTO "theates" ("address", "telefon", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["address", ""], ["telefon", ""], ["name", ""], ["created_at", "2018-04-20 11:43:01.212892"], ["updated_at", "2018-04-20 11:43:01.212892"]]
---
  def create
    @theate = Theate.new(theate_params)
    if @theate.save

SELECT  "theates".* FROM "theates" WHERE "theates"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @theate =Theate.find(params[:id])